# HideScopeBox Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..HideScopeBox Property
BaseExportOptions Class See Also
---
Whether or not to hide the scope box. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HideScopeBox { get; set; }
```

Visual Basic
---
```text
Public Property HideScopeBox As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HideScopeBox {
	bool get ();
	void set (bool value);
}
```

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace